**** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh

mkdir /dev/tmp

echo PORTAGE_TMPDIR=\"/dev/tmp\" >> /etc/portage/make.conf

emerge \
       sys-devel/llvm

#+END_SRC

#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 c5766 c5766 108 Aug 23 18:11 build.sh
-rwxr-xr-x 1 c5766 c5766 108 Aug 23 18:11 build.sh

mkdir /dev/tmp

echo PORTAGE_TMPDIR=\"/dev/tmp\" >> /etc/portage/make.conf

emerge \
       sys-devel/llvm

    
**** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh

cat <<EOF >  /tmp/stage4.excl
.bash_history
/mnt/*
/tmp/*
/proc/*
/sys/*
/dev/*
EOF

f="stage4_20170822.tar.xz"

tar -X /tmp/stage4.excl -c / | xz -7vT0  > /dev/$f

wget --method PUT --body-file=/dev/$f https://transfer.sh/$f -O - -nv

#+END_SRC

#+RESULTS:

#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

# cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 c5766 c5766 236 Aug 22 15:13 build.sh
-rwxr-xr-x 1 c5766 c5766 236 Aug 22 15:13 build.sh

    
*** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh

mkdir /etc/portage/repos.conf

cat <<EOF >  /etc/portage/repos.conf/gentoo.conf
[gentoo]
location = /dev/portage
EOF

echo PORTAGE_TMPDIR=\"/dev/tmp\" >> /etc/portage/make.conf

emerge-webrsync

echo ">=sys-kernel/hardened-sources-4.8.17-r2:4.8.17-r2" > /etc/portage/package.mask/hardened-sources

emerge \
       sys-kernel/hardened-sources 


#+END_SRC

#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

# cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 c5766 c5766 343 Aug 21 16:17 build.sh
-rwxr-xr-x 1 c5766 c5766 343 Aug 21 16:17 build.sh

    
*** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh

mkdir /etc/portage/repos.conf

cat <<EOF >  /etc/portage/repos.conf/gentoo.conf
[gentoo]
location = /dev/portage
EOF

echo PORTAGE_TMPDIR=\"/dev/tmp\" >> /etc/portage/make.conf

emerge-webrsync

echo ">=sys-kernel/hardened-sources-4.8.17-r2:4.8.17-r2" > /etc/portage/package.mask/hardened-sources

emerge \
       sys-kernel/hardened-sources 


#+END_SRC

#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

# cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 c5766 c5766 343 Aug 21 16:17 build.sh
-rwxr-xr-x 1 c5766 c5766 343 Aug 21 16:17 build.sh

    
*** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh

cat <<EOF >  /tmp/stage4.excl
.bash_history
/mnt/*
/tmp/*
/proc/*
/sys/*
/dev/*
EOF

f="stage4_20170821.tar.xz"

tar -X /tmp/stage4.excl -c / | xz -7vT0  > /tmp/$f

curl --upload-file  /tmp/$f https://transfer.sh/$f
#+END_SRC

#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

# cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 c5766 c5766 217 Aug 21 11:09 build.sh
-rwxr-xr-x 1 c5766 c5766 217 Aug 21 11:09 build.sh

    
*** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh

emerge \
       net-misc/proxychains \
       net-misc/dhcpcd \
       net-misc/autossh \
       net-misc/keychain \
       sys-boot/grub \
       app-misc/mc \
       dev-vcs/git

#+END_SRC

#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

# cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 c5766 c5766 181 Aug 17 09:26 build.sh
-rwxr-xr-x 1 c5766 c5766 181 Aug 17 09:26 build.sh

    
*** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh

echo "app-editors/emacs xft X jpeg png svg tiff alsa gif imagemagick" > /etc/portage/package.use/emacs

emerge \
       app-editors/emacs \
       --autounmask-write 

yes | etc-update --automode -3

emerge \
       app-editors/emacs 

#+END_SRC

#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

# cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 c5766 c5766 235 Aug 17 07:39 build.sh
-rwxr-xr-x 1 c5766 c5766 235 Aug 17 07:39 build.sh

    
*** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh

echo ">=sys-kernel/hardened-sources-4.8.17-r2:4.8.17-r2" > /etc/portage/package.mask/hardened-sources

# echo "app-editors/emacs xft X jpeg png svg tiff alsa gif imagemagick sound" > /etc/portage/package.use/emacs

emerge \
       x11-base/xorg-server \
       x11-apps/xrandr \
       x11-terms/xterm \
       x11-wm/spectrwm \
       sys-kernel/hardened-sources 

#+END_SRC

#+RESULTS:

#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

# cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 c5766 c5766 365 Aug 16 18:10 build.sh
-rwxr-xr-x 1 c5766 c5766 365 Aug 16 18:10 build.sh

    
*** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh

echo ">=sys-kernel/hardened-sources-4.8.17-r2:4.8.17-r2" > /etc/portage/package.mask/hardened-sources

echo "app-editors/emacs xft X jpeg png svg tiff alsa gif imagemagick sound" > /etc/portage/package.use/emacs

emerge \
       x11-base/xorg-server \
       x11-apps/xrandr \
       x11-terms/xterm \
       x11-wm/spectrwm \
       sys-kernel/hardened-sources \
       app-editors/emacs \
       --autounmask-write 

yes | etc-update --automode -3

emerge \
       x11-base/xorg-drivers \
       x11-base/xorg-server \
       x11-apps/xrandr \
       x11-terms/xterm \
       x11-wm/spectrwm \
       sys-kernel/hardened-sources \
       app-editors/emacs 

#+END_SRC

#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

# cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 c5766 c5766 659 Aug 16 16:09 build.sh
-rwxr-xr-x 1 c5766 c5766 659 Aug 16 16:09 build.sh

    
*** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh

emerge \
       dev-libs/gobject-introspection

#+END_SRC

#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

# cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 c5766 c5766 48 Aug 16 10:07 build.sh
-rwxr-xr-x 1 c5766 c5766 48 Aug 16 10:07 build.sh


*** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh

echo ">=sys-kernel/hardened-sources-4.8.17-r2:4.8.17-r2" > /etc/portage/package.mask/hardened-sources

echo "app-editors/emacs xft X jpeg png svg tiff alsa gif imagemagick sound" > /etc/portage/package.use/emacs

emerge \
       sys-kernel/hardened-sources \
       x11-base/xorg-drivers \
       x11-base/xorg-server \
       x11-apps/xrandr \
       x11-terms/xterm \
       x11-wm/spectrwm \
       app-editors/emacs \
       --autounmask-write 

yes | etc-update --automode -3

emerge \
       sys-kernel/hardened-sources \
       x11-base/xorg-drivers \
       x11-base/xorg-server \
       x11-apps/xrandr \
       x11-terms/xterm \
       x11-wm/spectrwm \
       app-editors/emacs 

#+END_SRC

#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

# cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 user1 user1 690 Aug 15 23:00 build.sh
-rwxr-xr-x 1 user1 user1 690 Aug 15 23:00 build.sh


*** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh

echo ">=sys-kernel/hardened-sources-4.8.17-r2:4.8.17-r2" > /etc/portage/package.mask/hardened-sources

echo "app-editors/emacs xft X jpeg png svg tiff alsa gif imagemagick sound" > /etc/portage/package.use/emacs

emerge \
       sys-kernel/hardened-sources \
       x11-base/xorg-drivers \
       x11-base/xorg-server \
       x11-apps/xrandr \
       x11-terms/xterm \
       x11-wm/spectrwm \
       app-editors/emacs \
       --autounmask-write 

yes | etc-update --automode -3

emerge \
       sys-kernel/hardened-sources \
       x11-base/xorg-drivers \
       x11-base/xorg-server \
       x11-apps/xrandr \
       x11-terms/xterm \
       x11-wm/spectrwm \
       app-editors/emacs 

#+END_SRC

#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

# cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 user1 user1 690 Aug 15 23:00 build.sh
-rwxr-xr-x 1 user1 user1 690 Aug 15 23:00 build.sh

*** build.sh
#+HEADER:  :tangle build.sh
#+BEGIN_SRC sh
#!/bin/bash

mkdir /usr/portage

emerge-webrsync

mkdir -p /etc/portage/package.mask/



# udev, video cards, X, 

sed -i 's/USE="/USE="udev xattr /' /etc/portage/make.conf 

cat <<EOF >> /etc/portage/make.conf

INPUT_DEVICES="libinput"

VIDEO_CARDS="nouveau intel i915"

# PAX_MARKINGS="XT" 

FEATURES="test"

EOF


emerge --changed-use --deep @world 

rc-update add udev sysinit



cat <<EOF >  /etc/conf.d/net

dns_domain_lo="my_domain"

config_enp1s0="dhcp"

EOF

mkdir /usr/portage/env

cat <<EOF >  /etc/portage/env/compiler-clang  
CC="clang"
CXX="clang++"
CFLAGS="${CFLAGS} -flto=thin"              
CXXFLAGS="${CXXFLAGS} -flto=thin"          
LDFLAGS="-Wl,-O2 -Wl,--as-needed"    #please use whichever optimization level you're comfortable with
EOF

cat <<EOF > /etc/portage/env/compiler-gcc
CC="gcc"
CXX="g++"
CFLAGS="-O2 -pipe"
CXXFLAGS="${CFLAGS}"
EOF


cat <<EOF > /etc/portage/package.env
sys-devel/llvm compiler-clang  
EOF


cd /etc/init.d
ln -s net.lo net.enp1s0
rc-update add net.enp1s0 default

emerge --noreplace net-misc/netifrc

echo "sys-devel/llvm gold clang" > /etc/portage/package.use/llvm



emerge sys-devel/binutils-config

binutils-config --linker ld.gold

emerge \
       dev-util/re2c \
       dev-util/ninja \
       app-arch/libarchive \
       net-misc/curl \
       dev-libs/libuv \
       dev-util/cmake \
       sys-devel/clang 

#+END_SRC


#+HEADERS: :results raw
#+BEGIN_SRC sh
ls -lha build.sh

chmod +x build.sh

ls -lha build.sh

# cat build.sh
#+END_SRC

#+RESULTS:
-rw-r--r-- 1 c5766 c5766 1.4K Aug 15 13:03 build.sh
-rwxr-xr-x 1 c5766 c5766 1.4K Aug 15 13:03 build.sh

***** btrfs subvolume

http://www.grymoire.com/Unix/sed.html

#+HEADERS: :results raw
#+BEGIN_SRC sh

  mount  | awk '$3 ~ /^\/$/ {print $NF}' | sed 's/.*subvol=\/\(.*\))/\1/'
# mount  | awk '$3 ~ /^\/$/ {print $NF}' | sed 's/.*subvol=\/\(.*\)/\1/'

# mount | awk '$3 ~ /^\/$/ {print $NF}' # | awk 'BEGIN{ FS="[,]"} {print $NF}'  
# mount | awk '$3 ~ /^\/$/ {print $NF}' # | awk 'BEGIN{ FS="[,]"} {print $NF}'  

#+END_SRC

#+RESULTS:
fs2/snapshot20160210
fs2/snapshot20160210)
(rw,noatime,compress=lzo,noacl,space_cache,autodefrag,inode_cache,subvolid=263,subvol=/fs2/snapshot20160210)
(rw,noatime,compress=lzo,noacl,space_cache,autodefrag,inode_cache,subvolid=263,subvol=/fs2/snapshot20160210)

***** root device

#+HEADERS: :results raw
#+BEGIN_SRC sh

mount | awk '$3 ~ /^\/$/ {print $1}' | awk 'BEGIN{ FS="[/]"} {print $3}'

#  mount #| awk '$3 ~ /^\/$/ {print $1}'   | awk 'BEGIN{ FS="[/]"} {print $3}'
#  mount  | awk '$3 ~ /^\/$/ {print $1}' # | awk 'BEGIN{ FS="[/]"} {print $3}'
#  mount  | awk '$3 ~ /^\/$/ {print $1}'   | awk 'BEGIN{ FS="[/]"} {print $3}'

#+END_SRC

#+RESULTS:
sdb



